Autodesk.Revit.DB.DirectShapeOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectShapeOptions.RoomBoundingOption
Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.ReferencingOption
Whether or not the geometry stored in a DirectShape or DirectShapeType object may be referenced.
Remarks:
If the geometry is not referenceable, it may not be used for dimensioning, snapping, alingment, or face-hosting.
The element may still be selected by the user for operations which do not reference individual geometry objects.
The default value is Referenceable.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions
This class is used to control behavior of a DirectShape or a DirectShapeType object.
Remarks:
Use Enable/Disable functions to change the default behavior.
Use DirectShape.SetOptions to modify that object's behavior.
Since:
2016